app/Controllers/CrudController.php

    public function index()
    {
        $model = new Usuarios_model();
        $data['usuarios'] = $model->orderBy('id_usuario', 'DESC')->findAll();
---
SELECT *
FROM `usuarios`
ORDER BY `id_usuario` DESC

    public function store()
    {
        $input = $this->validate([
            'nombre'   => 'required|min_length[3]',
            'apellido' => 'required|min_length[3]|max_length[25]',
            'email'    => 'required|min_length[4]|max_length[100]|valid_email|is_unique[usuarios.email]',
            'usuario'  => 'required|min_length[3]',
            'password' => 'required|min_length[3]|max_length[10]',
            'passconf' => 'required|min_length[3]|max_length[10]|matches[password]',
            'perfil_id'  => 'required|min_length[1]|max_length[1]',
        ]);

        $model = new Usuarios_model();

        if (!$input) {
            $data['titulo'] = 'Registro';
            echo view('layout/head', $data);
            echo view('layout/menu');
            echo view('usuario/alta_usuario', [
                'validation' => $this->validator
            ]);
        } else {
            $data = [
                'nombre' => $this->request->getVar('nombre'),
                'apellido' => $this->request->getVar('apellido'),
                'usuario' => $this->request->getVar('usuario'),
                'email'  => $this->request->getVar('email'),
                'password'  => password_hash($this->request->getVar('password'), PASSWORD_DEFAULT),
                'perfil_id'  => $this->request->getVar('perfil_id'),
            ];
            $model->insert($data);
---
INSERT INTO `usuarios` (`nombre`, `apellido`, `usuario`, `email`, `password`, `perfil_id`) VALUES ('Yesica Elisabeth', 'Ramirez', 'yesi1004', 'yesica@gmail.com', '$2y$10$qsSJBhmIVaN9re07xGeGy.6.c0HQV5zM6.XIe.Kkya8j0hNMWXCUm', '1')

    public function singleUser($id_usuario = null)
    {
        $model = new Usuarios_model();
        $dato['user_obj'] = $model->where('id_usuario', $id_usuario)->first();
---
SELECT *
FROM `usuarios`
WHERE `id_usuario` = '7'
 LIMIT 1

    public function usuarios_eliminados() {
        $NameModel = new Usuarios_model();
        $data['usuarios'] = $NameModel->orderBy('id_usuario', 'DESC')->findAll();
---
SELECT *
FROM `usuarios`
ORDER BY `id_usuario` DESC

    public function colocar($baja = null)
    {
        $NameModel = new Usuarios_model();
        $data['usuarios'] = $NameModel->where('baja', $baja)->delete($baja);
        $data = ([
            'baja' => 'No',
        ]);
        $NameModel->update($baja, $data);
---
UPDATE `usuarios` SET `baja` = 'No'
WHERE `usuarios`.`id_usuario` IN ('6')